print('Здравствуте, выберете длину слова, которое хотите отгадывать! 1-6 ; 2-11 Введите номер 1 или 2 ')
vvod = int(input())
import random
flaglet = 6 ## 6 букв
osh = 10 ## Количество допустимых ошибок
flagosh = 0
en = 1
let6 = 'Анчоус Армеец Афронт Адажио Альянс Апломб Артрит Азимут Амфора \
Бампер Барыня Бедлам Бензин Бикини Бобина Боксит Ботики Брести Брынза \
Виадук Висмут Внутри Волчий Вощина Вражда Втулка  \
Галифе Гектар Гильза Гнедой Гольфы Гормон Графит Группа Гурман \
Датчик Денщик Детище Дизель Добыча Должно Доярка Дрожки \
Ералаш Епанча Ехидна Ендова Ерунда Ежонок Ельник \
Железа Живица Желудь Жавель Жвачка \
Засека Злодей Зрачок Заводь Зануда Заступ \
Игрище Изотоп Ириска Имбирь Имярек Истина \
Комизм Кончик Корнет Коряга Кошара Кривда Кувшин Кабала Купюра \
Лейкоз Лиризм Локоть Лоцман Льгота Ландыш \
Маркиз Махина Мелочь Метель Миляга Мичман Монтер Мотыль \
Низина Нокаут Нянька Неволя \
Обушок Огниво Оратай Отвага Отступ \
Пирога Пугало Плавка Путеец Плебей Погань Поддон \
Радиус Разлив Ракита Распря Ресурс Розыск Рубчик \
Сеялка Сияние Склока Слабак Смешок Собрат \
Тамбур Телекс Термин Топляк Травма Триада Трусца \
Упадок Утопия Управа \
Фильтр Фонарь Фундук Фабула Фелюга Флажок Форель Фантом Фестон Фигура \
Хибара Хромка Хазары Хирург Хозяин Хандра Хлебец Хоромы \
Цветок Цикута Цемент Цепкий Цветик Циклоп Цифирь \
Челядь Чеснок Чихирь Чуткий Чардаш Чердак Чудила Чавыча \
Шафран Шерсть Шкипер Шутник Швабра Шлепок Штанга \
Щеголь Щенная Щетина Щебень \
Эконом Эрудит Эстамп Эпигон Эгоист Эколог Эрозия Эллинг \
Юбиляр Юпитер Юбилей Юность Южанин Юдофоб Ювелир \
Яранга Ядрица Ятаган Ягдташ Ястреб Яичник Янтарь'.split()
let11 = '  Агротехника Архитектура  Акселерация Апокалипсис\
 Бюстгальтер \
 Видеозапись Волюнтаризм Второклашка\
 Газоубежище Гимнастерка Горнолыжник Гастрономия Гравировщик\
 Драматургия  Декаденство Дендрология\
   Единогласие Единомыслие Единообразие\
  Жардиньерка Жандармерия\
 Заблуждение Завоеватель Звукозапись\
 Исступление Имплантация  Иллюзионист Инкрустатор\
 Каламбурист Капельдинер Киномеханик Коллетивизм Комментатор Конспирация Конъюктивит \
 Лексикограф Любопытство Латифундист Легкомыслие Летописание Лаборатория Лицеприятие \
 Манипулятор Материализм Молитвенник Максималист  \
Океанология \
Сибаритство Сколопендра \
Текстология \
 Уплотнитель \
Физкультура Факультатив Фрикаделька Формировать \
Хронометраж Хулиганство Холодильник\
  Циркачество Цветомузыка Цинкография\
 Численность Червоточина Чернокнижие Четвертушка\
 Экскурсовод Экзаменатор Эсперантист Электроника Экзальтация\
 Языкознание Ядохимикаты Ясновидение'.split()

while vvod != 1 and vvod != 2:
    print('Введите номер 1 или 2')
    vvod = int(input())
if vvod == 2:
    flaglet = 11 ## 11 букв
    n = random.choice(let11)
else:
    n = random.choice(let6)
print('Выберете уровень сложности: 1--Гильотина(10 ошибок), 2--Висилица(6 ощибок), 3--Котел с кипящим маслом(2 ошибки)')
vvod = int(input())
while vvod != 1 and vvod != 2 and vvod != 3:
    print('Введите номер 1, 2 или 3')
    vvod = int(input())
if vvod == 2:
    osh = 6
    en = 2
elif vvod == 3:
    osh = 2
    en = 3
pob = 0
zve = '*' * flaglet
zve1 = list(zve)
n = n.lower()
ind = 0
print(zve)
coun = 1
while osh != 0 and pob != 1:
    t = n
    print('Введите предпологаемую букву')
    vvod = input().lower()
    while vvod not in 'йцукенгшщзхъфывапролджэячсмитьбю':
        print('Не испытывай мои нервы недалекий отрок, пожалуйста')
        vvod = input().lower()
        n = n.lower()
    if vvod in n:
        while n.find(vvod) != -1:
            zve1.insert(n.find(vvod) + ind, vvod)
            if n.find(vvod) + coun < len(zve1) or n.find(vvod) - coun >= 0:
                while zve1[n.find(vvod) + coun] == '*' or zve1[n.find(vvod) - coun] == '*':
                    coun += 1
                    if coun >= len(n):
                        break
            del zve1[n.find(vvod) + 1]
            ind += n.find(vvod) + 2
            n = n[n.find(vvod) + 1::]
        for i in zve1:
            print(i, end='')
        print()
        n = t
        ind = 0
    else:
        osh -= 1
        print('Вы ошиблись')
        print('Количество оставшихся ошибок :', osh)
        if en == 1:
            if osh == 5:
                print('Вас повели на эшафот, на котором и стояла железная машина убийца. При одном виде этого устройства бегут мурашки')
            if osh == 3:
                print('Пока вам зачитывают приговор вы думаете о своей жизни, кажеться вы все таки были больше хорошим человеком чем плохим')
            if osh == 1:
                print('Палачь грубо хватает вас и кладет вашу голову в округлое отверстие. Перед вашими глазами около пяти голов несчастных, которых постигла та же участь что может постигнет и вас. Вы начинате всем сердцем ненавидеть французов')
            if osh == 0:
                print('Кажется это того не сто... Косое лезвие начало свое падение. Шум от трения нарастал. Казалось, прошли минуты прежде чем оно коснулось вашей шеи. Ваша голова с необычайной легкостью отделилась от всего остального составляющего\
                вашего тела. Еще несколько секунд вы были способны воспринимать окружающий мир , но затем смерть достигла вас.  YOU DIED Слово было:', n)
        if en == 2:
            if osh == 5:
                print('Вас заставили самому подниматься по леснице на казнь. Что за дерзость!! Слева от вас висела толстая веревка из пеньки завязаня в петлю, а справа был громила палач.')
            if osh == 3:
                print('Пока вам зачитывают приговор вы думаете о своей жизни, кажеться вы все таки были больше хорошим человеком чем плохим')
            if osh == 1:
                print('Вас поставили на открывающийся во время кани люк и надели на ше..крхм.ю петлю. Ее затянули сильно, поэтому вам было сложно дышать. Может быть у вас еще есть шансы на чудесное спасение.')
            if osh == 0:
                print('Но нет, видимо не судьба. Вы не ожидали открытия люка под вами, но он окрылся. Вам не повезло. У вас не сломалась шея. Вы болтались на петле живым еще около пяти минут в ужасных муках. YOU DIED Слово было:', n)
        if en == 3:
            if osh == 2:
                print('Вас заключили в железные ошейники по рукам и ногам и повесили над котлом с маслом. Пока что приятная теплота разливалась по вашему телу, но ваша невиновная душа обливалась кровью')
            if osh == 1:
                print('Вы были опущены ближе к маслу , так что до вас волетали брызги от кипения. Самые большие из них доставляли массу боли и оставляли после себя волдыри. Может еще есть шанс на спасение подумали вы в отчаянье')
            if osh == 0:
                print('Смертный приговор был вынесен и вас стали постепенно опускать все ниже и ниже. Вдруг пальцы ваших ног коснулись поверхности жидкости. Невыносимая боль потихоньку расползалась по вашему телу. Как будто в душе\
                случайно слишком\
                сильно крутанули кран с горячей водой, но вместо того что бы закрыть его вы просто продолжали принимать душ. Вас опустили уже по плечи, ноги\
                уже ничего не чувствовали, но почему то вы были еще в сознании и были способны осозновать \
                ту ужасанейшую боль. Вы попытались вдохнуть, но было уже поздно и горячее масло устремилось в ваш желудок и легкие. Ужасная смерть. YOU DIED Слово было:', n)
    if '*' not in str(zve1):
        pob = 1
        print('Поздравляю, ты смог пройти мое простейшее испытание искатель приключений')
